#include <iostream>
using namespace std;

// создание структуры.
struct Point
{
	// структура Point описывает точки на плоскости.
	double x; // координата x.
	double y; // координата y.
};

//—оздава€ структуру или класс, мы создаем новый тип данных,
// а объ€вл€€ объкекты этого класса или структуры мы создаем переменные этого типа.

//  ласс - это тип данных.
//—труктура - это тип данных.
// ќбъект - это сама€ обыкновенна€ переменна€.

void main()
{
	setlocale(LC_ALL, "Rus");
	int a; // объ€вление переменной типа int.
	Point A; //объ€вление объекта ј структуры Point.
             // объ€вление переменной ј типа Point.
}